JFiore31/ME461_repo/C2000Ware_4_01_00_00/device_support/f2802x/f28027_ls7366/f28027_encoder_spi.c
    temp = SpiaRegs.SPIRXBUF;


    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
    SpiaRegs.SPITXBUF = ((unsigned)0x88)<<8;  // WR to MDR0
    SpiaRegs.SPITXBUF = ((unsigned)0x83)<<8;
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 2) {}
    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;

    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
    SpiaRegs.SPITXBUF = ((unsigned)0x90)<<8;  // WR MDR1
    SpiaRegs.SPITXBUF = 0x01<<8;
    while (SpiaRegs.SPIFFRX.bit.RXFFST != 2) {}
    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;

    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    SpiaRegs.SPICTL.bit.SPIINTENA = 1;
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR = 1;
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR = 1;
    SpiaRegs.SPIFFRX.bit.RXFFIENA = 1;

    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE
    PieCtrlRegs.PIEIER6.bit.INTx1 = 1;  //Enable PIE 6.1 interrupt
}

void start_SPI(void) {
//    SpiaRegs.SPICCR.bit.SPICHAR      = 0x7;  // Set to transmit 8 bits
    SpiaRegs.SPIFFRX.bit.RXFFIL = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
    GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;

    SpiaRegs.SPITXBUF = ((unsigned)0xE8)<<8; // Latch All ENCs
    SPIenc_state = 1;
}


__interrupt void adc_isr(void)
{
    ADC0raw = AdcResult.ADCRESULT0;
    microphone = ((float)((ADC0raw)/4096.0))*2147483648;
    if (pingpong == 0) {
        ipcbsrcping[fftsamplecount] = microphone;
        fftsamplecount++;
        if (fftsamplecount == FFT_SIZE) {
            fftsamplecount = 0;
            runpingfftcount = 0;
            RunPingFFT = 1;
            pingpong = 1;
        }
    } else {
        ipcbsrcpong[fftsamplecount] = microphone;
        fftsamplecount++;
        if (fftsamplecount == FFT_SIZE) {

            fftsamplecount = 0;
            runpingfftcount = 0;
            RunPongFFT = 1;
            pingpong = 0;
        }
    }



    ADCcount++;
    if ((ADCcount%500)==0) {
        GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    }
    //
    // Clear ADCINT1 flag reinitialize for next SOC
    //
    AdcRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;

    //
    // Acknowledge interrupt to PIE
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

}

void SPI_RXint(void) {


    GpioDataRegs.GPASET.bit.GPIO4 = 1;
    GpioDataRegs.GPASET.bit.GPIO6 = 1;
    switch (SPIenc_state) {
        case 1:
            temp = SpiaRegs.SPIRXBUF;

            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 2;
            GpioDataRegs.GPACLEAR.bit.GPIO4 = 1;
            SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
            SpiaRegs.SPITXBUF = 0;
            SpiaRegs.SPITXBUF = 0;
            SpiaRegs.SPITXBUF = 0;
            break;
        case 2:

            SPIbyte1 = SpiaRegs.SPIRXBUF;
            SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
            SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
            SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
//            SPIenc1_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;
            SPIenc1_reading =  ((SPIbyte2<<16) | (SPIbyte3<<8) | SPIbyte4)<<8;
            SPIenc1_reading = SPIenc1_reading >>8;
            SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
            SPIenc_state = 3;
            GpioDataRegs.GPACLEAR.bit.GPIO6 = 1;
            SpiaRegs.SPITXBUF = ((unsigned)0x68)<<8;
            SpiaRegs.SPITXBUF = 0;
            SpiaRegs.SPITXBUF = 0;
            SpiaRegs.SPITXBUF = 0;
            break;

        case 3:
            SPIenc_state = 30;
            SPIbyte1 = SpiaRegs.SPIRXBUF;
            SPIbyte2 = SpiaRegs.SPIRXBUF & 0xFF;
            SPIbyte3 = SpiaRegs.SPIRXBUF & 0xFF;
            SPIbyte4 = SpiaRegs.SPIRXBUF & 0xFF;
//            SPIenc2_reading = (SPIbyte2<<24) | (SPIbyte3<<16) | (SPIbyte4<<8) | SPIbyte5;
            SPIenc2_reading = ((SPIbyte2<<16) | (SPIbyte3<<8) | SPIbyte4)<<8;
            SPIenc2_reading = SPIenc2_reading>>8;
//            SWI_post(&SWI_control);
            break;
    }
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR=1;  // Clear Overflow flag
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR=1;  // Clear Interrupt flag
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE

}

//
// cpu_timer0_isr - 
//
__interrupt void cpu_timer0_isr(void)
{
    Timer0Count++;
    if (Timer0Count > 32000) { // Rolls over at 32767 so catch before that point
        Timer0Count = 0;
    }
   // GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
	UARTPrint = 1;
    //
    // Acknowledge this interrupt to receive more interrupts from group 1
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

//
// cpu_timer1_isr - 
//
__interrupt void cpu_timer1_isr(void)
{
    CpuTimer1.InterruptCount++;
    start_SPI();
    //
    // The CPU acknowledges the interrupt
    //
    EDIS;
}

//
// cpu_timer2_isr - 
//
__interrupt void cpu_timer2_isr(void)
{  
    EALLOW;
    CpuTimer2.InterruptCount++;
    
    //
    // The CPU acknowledges the interrupt.
    //
    EDIS;
}

// This function is called each time a char is recieved over UARTA.
void serialRXA(serial_t *s, char data) {
    numRXA ++;

}

//
// End of File
//
